{"title": "Seattle City Council 3/1/2022", "video_id": "gCrSxkFlP_Q", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nPursuant to Washington State Governor's Proclamation No. 20-28.15 and Senate Concurrent Resolution 8402, this public meeting will be held remotely. Meeting participation is limited to access by the telephone number provided on the meeting agenda, and the meeting is accessible via telephone and Seattle Channel online.\nAgenda: Call to Order, Roll Call, Presentations, Approval of Consent Calendar, Approval of the Agenda; Public Comment; CB 120270: relating to taxation, delaying the effective date of the heating oil tax; CB 120272: relating to staffing shortages in the Community Safety Communications Center and the Seattle Police Department; Res 32043: declaring the intention to hold a public hearing relating to assessment rate for the Seattle Tourism Improvement Area; CF 314441: Application of Wallace Properties - Park at Northgate, LLC for a contract rezone; CB 120275: relating to land use and zoning - rezone; Res 32045: adopting the Statements of Legislative Intent for the 2022 Adopted Budget and 2022-2027 Adopted Capital Improvement Program; Res 32046: adopting the Seattle City Council 2022 Work Program; Other Business.\n0:00 Call to Order\n1:43 Proclamation recognizing Assistant City Auditor Virginia Garcia\n10:13 Proclamation recognizing Seattle Kraken Day\n22:31 Public Comment\n31:36 Proclamation recognizing Seattle Kraken Day\n36:35 CB 120272: relating to staffing shortages\n50:25 Res 32043: Relating to the Seattle Tourism Improvement Area\n54:17 CF 314441: Application of Wallace Properties\n58:25 CB 120275: relating to land use and zoning - rezone\n1:01:17 Res 32045: 2022 Adopted Budget & 2022-2027 Adopted Capital Improvement Program\n1:03:45 Res 32046: Seattle City Council 2022 Work Program\n1:06:05 Other Business", "publish_date": "2022-03-01T00:00:00"}