{"title": "Seattle City Council 6/28/21", "video_id": "giOX4f2p9sg", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120107: relating to City employment; CB 120098: relating to the Board of Park Commissioners; Appointments and Reappointments to Seattle Ethics and Elections Commission; Families, Education, Preschool and Promise Levy Oversight Committee; Landmarks Preservation Board; Appointment of Meghann McCann as Court Administrator of the Seattle Municipal Court; CB 120106: relating to historic preservation - Bordeaux House; CB 120081: relating to affordable housing on properties owned or controlled by religious organizations; Appointments to Green New Deal Oversight Board.\nAdvance to a specific part\nPresentation - Proclamation honoring Dave Schmitz - 1:04\nPublic Comment - 18:25\nPayment of Bills - 37:41\nCB 120107: relating to City employment - 38:52\nCB 120098: relating to the Board of Park Commissioners - 41:10\nAppointments and Reappointments to Seattle Ethics and Elections Commission; Families, Education, Preschool and Promise Levy Oversight Committee; Landmarks Preservation Board - 44:21\nAppointment of Meghann McCann as Court Administrator of the Seattle Municipal Court - 51:59\nCB 120106: relating to historic preservation - Bordeaux House - 58:54\nCB 120081: relating to affordable housing - 1:01:24\nAppointments to Green New Deal Oversight Board - 1:41:40", "publish_date": "2021-06-28T00:00:00"}