{"title": "Seattle City Council 9/20/21", "video_id": "8mjI23Ixx5Q", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Public Hearing - CB 120157: relating to affordable housing on properties owned or controlled by religious organizations; Payment of Bills; Appointment to Families, Education, Preschool and Promise Levy Oversight Committee; Reappointment of David G. Jones as City Auditor; CB 120172: relating to City employment; CB 120142: relating to the Seattle Police Department; Res 32019: honorary designation of \"Lenny Wilkens Way\"; CB 120160: relating to City Light Department - Renewable Plus Program; CB 120170: relating to City Light Department - Skagit Habitat Enhancement Program; CB 120174: granting permission to the Board of Regents of the University of Washington to continue to operate and maintain an existing underground pedestrian concourse tunnel; CB 120161: relating to Seattle Public Utilities - updating water regulations; CB 120175: authorizing Seattle Public Utilities to execute agreements for projects and programs that prevent water pollution; CB 120171: relating to surveillance technology implementation - Seattle Fire Department's use of Emergency Scene Cameras and Hazardous Materials Cameras; CB 120156: relating to the Multifamily Housing Property Tax Exemption Program; Res 32017: calling for research, engagement and presentation of information to the Mayor and City Council on the Multifamily Tax Exemption (MFTE) program prior to considering renewal of the program in 2023; CB 120163: relating to City of Seattle right-of-way along the Central Waterfront; Reappointments to Seattle Indian Services Commission.\n0:00 Call to order\n0:47 Presentations\n12:37 Public Comment\n1:19:33 Public Hearing on CB 120157: affordable housing\n1:39:17 Payment of Bills\n1:41:02 Appointment\n1:42:37 Reappointment of David G. Jones, City Auditor\n1:59:37 CB 120172: relating to City employment\n2:01:12 CB 120142: relating to Seattle Police Department\n3:34:40 Res 32019: Honorary designation of \"Lenny Wilkens Way\"\n3:36:13 CB 120160: City Light Department - Renewable Plus program\n3:37:47 CB 120170: City Light Department - Skagit Habitat Enhancement Program\n3:39:10 CB 120174: Underground pedestrian concourse tunnel\n3:40:41 CB 120161: Seattle Public Utilities water regulations\n3:42:00 CB 120175: Authorizing Seattle Public Utilities to execute agreements\n3:43:25 CB 120171: relating to surveillance technology implementation \n3:44:46 CB 120156: relating to Multifamily Housing Property Tax Exemption program\n3:47:38 Res 32017: relating to Multifamily Housing Property Tax Exemption program\n3:52:27 CB 120163: relating to City of Seattle right-of-way along Central Waterfront\n3:54:17 Reappointments", "publish_date": "2021-09-20T00:00:00"}