{"title": "Seattle City Council Transportation and Utilities Committee May 19, 2021", "video_id": "JlIi5eSRB4w", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28, et. seq., until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call To Order, Approval of the Agenda; Public Comment; CB 120074: Grange Insurance Association pedestrian skybridge; CB 120061: Northwest Kidney Center pedestrian tunnel; CB 120075: BGO Plaza 600 JV LLC  vehicular and pedestrian tunnel; CB 120076: IC/RCDP Seattle Hotel, LLC pedestrian tunnel; Reappointment to Seattle School Traffic Safety Committee; CB 120052: relating to the City Light Department - Interlocal Agreement with Skagit County; Presentation: Internet for All Status Report; CB 120053: surveillance technology implementation - Forward-Looking Infrared Real-Time Video; CB 120054: surveillance technology implementation - Situational Awareness Cameras; CB 120055: surveillance technology implementation - Video Recording Systems.\nAdvance to a specific part\nPublic Comment - 1:42\nCB 120074: Grange Insurance Association pedestrian skybridge - 6:41\nCB 120061: Northwest Kidney Center pedestrian tunnel - 13:17\nCB 120075: BGO Plaza 600 JV LLC vehicular and pedestrian tunnel - 16:26\nCB 120076: IC/RCDP Seattle Hotel, LLC pedestrian tunnel - 19:52\nReappointment to Seattle School Traffic Safety Committee - 24:46\nCB 120052: City Light Department - Interlocal Agreement with Skagit County - 27:57\nPresentation: Internet for All Status Report - 39:06\nCB 120053: Forward-Looking Infrared Real-Time Video - 1:21:10\nCB 120054: Situational Awareness Cameras - 1:40:52\nCB 120055: Video Recording Systems - 1:53:55", "publish_date": "2021-05-19T00:00:00"}