{"title": "Seattle City Council Transportation & Utilities Committee 12/2/20", "video_id": "aIHc-LZWG24", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation No. 20-28.12, through December 7, 2020. Meeting participation is limited to access by telephone conference line and Seattle Channel online.\nAgenda: Call To Order, Approval of the Agenda; Public Comment; CB 119955: relating to Seattle Public Utilities - Cedar River Pipelines right-of-way, includes public hearing; CB 119958: relating to the Cedar River Watershed Habitat Conservation Plan - includes public hearing; CB 119956: relating to Seattle Public Utilities - King County Fire Protection District 40; CB 119961: relating to Seattle Public Utilities - acquired property rights; CB 119963: relating to Seattle Public Utilities - updating water regulations; CB 119962: relating to Seattle Public Utilities - stormwater facility; CB 119953: relating to City Light Department - accepting various easements; CB 119954: relating to City Light Department - accepting various easements; Res 31980: private utility lines; CB 119959: imposing a revenue measure; CB 119960: regarding the Transit Service Funding Agreement; Res 31981: Seattle Department of Transportation - Recreation and Conservation Office.\nAdvance to a specific part\nPublic Comment - 2:02\nCB 119955: Cedar River Pipelines right-of-way, includes public hearing - 3:34\nCB 119958: Cedar River Watershed Habitat Conservation Plan - includes public hearing; - 14:32\nCB 119956: King County Fire Protection District 40 - 31:55\nCB 119961: relating to Seattle Public Utilities - acquired property rights - 39:06\nCB 119963: relating to Seattle Public Utilities - updating water regulations - 55:37\nCB 119962: relating to Seattle Public Utilities - stormwater facility - 1:07:10\nCB 119953: relating to City Light Department - accepting various easements - 1:13:52\nCB 119954: relating to City Light Department - accepting various easements - 1:20:12\nRes 31980: private utility line - Roy Street - 1:21:57\nCB 119959: imposing a revenue measure - 1:31:14\nCB 119960: regarding the Transit Service Funding Agreement - 1:40:18\nRes 31981: Seattle Department of Transportation - Recreation and Conservation Office - 1:45:26", "publish_date": "2020-12-02T00:00:00"}