{"title": "Seattle City Council 12/13/2021", "video_id": "v2hHl8BqcvE", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nPursuant to Washington State Governor's Proclamation No. 20-28.15 and Senate Concurrent Resolution 8402, this public meeting will be held remotely. Meeting participation is limited to access by the telephone number provided on the meeting agenda, and the meeting is accessible via telephone and Seattle Channel online.\n\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120242: relating to City employment - memorandum of understanding between The City of Seattle and certain City unions; CB 120243: relating to City employment - providing salary increases for 2022; CB 120244 - 2022 Pay Zone Ordinance; CB 120184: relating to City employment - establishing Juneteenth as a legal holiday; CB 120246: relating to the City's traffic code; Res 32032: setting forth The City of Seattle's 2022 State Legislative Agenda; CB 120119: relating to employment in Seattle - hazard pay; CB 120238: relating to funding for housing - 2021 Annual Action Plan; CB 120227: related to street vacations; Appointments and Reappointments to Domestic Workers Standards Board, Burke Gilman Public Development Authority Governing Council, Community Roots Housing Public Development Authority Governing Council, Seattle Housing Authority Board; Res 32029: adopting General Rules and Procedures of the Seattle City Council; CB 120215: relating to land use review decision procedures; CB 120239: relating to Seattle's construction codes; CB 120206: relating to land use and zoning - Mobile Home Park Overlay District; CB 120214: relating to land use and zoning - Neighborhood Residential zones; CB 120235: relating to historic preservation - 802 16th Avenue; CB 120164: relating to Seattle Parks and Recreation - Woodland Park Zoo; CB 120188: creating an Indigenous Advisory Council; Res 32034: relating to Seattle Parks and Recreation - State Recreation and Conservation Office (RCO); CB 120248: relating to City employment - Fire Chief; CB 120247: relating to the organization of City government - City Attorney's Office; Res 32033: intent to consider strategies to ensure that all unreinforced masonry buildings in Seattle are seismically retrofitted; CB 120241: relating to human rights; Appointments and Reappointments to Seattle Human Rights Commission, Seattle Women's Commission, Seattle Disability Commission, Seattle LGBTQ Commission; Res 32035: Crown Hill Urban Village Action Plan.\n0:00 Call to Order\n0:55 Presentations\n33:28 Public Comment\n1:15:12 Payment of Bills\n1:16:12 CB 120242: relating to City employment\n1:20:58 CB 120243: relating to City employment\n1:24:17 CB 120244: relating to City employment\n1:27:06 CB 120184: relating to City employment\n1:30:25 CB 120246: relating to the City's traffic code\n1:33:07 Res 32032: City of Seattle's 2022 State Legislative Agenda\n1:38:45 CB 120119: relating to employment in Seattle - hazard pay\n1:50:23 CB 120238: relating to funding for housing\n1:52:04 CB 120227: related to street vacations\n1:55:37 Appointments and Reappointments\n2:05:27 Res 32029: General Rules and Procedures of the Seattle City Council\n2:30:06 CB 120215: relating to land use review decision procedures\n2:34:06 CB 120239: relating to Seattle's construction codes\n2:38:03 CB 120206: relating to land use and zoning\n2:43:19 CB 120214: relating to land use and zoning\n2:48:09 CB 120235: relating to historic preservation\n2:52:11 CB 120164: relating to Seattle Parks and Recreation\n2:57:56 CB 120188: creating an Indigenous Advisory Council\n3:01:50 Res 32034: relating to Seattle Parks and Recreation\n3:03:48 CB 120248: relating to City employment\n3:06:11 CB 120247: relating to the organization of City government\n3:17:57 Res 32033: unreinforced masonry buildings\n3:23:12 CB 120241: relating to human rights\n3:25:33 Appointments and Reappointments\n3:34:37 Res 32035: Crown Hill Urban Village Action Plan", "publish_date": "2021-12-13T00:00:00"}