{"title": "City Council 9/27/21", "video_id": "VUEY6ItULgQ", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\n\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CF 314485: Mayor Jenny A. Durkan's Budget Address on the 2022 Budget; CB 120157: relating to affordable housing on properties owned or controlled by religious organizations; Appointments and Reappointments to Pioneer Square Preservation Board; CB 119585: relating to residential rental properties; CB 120173: relating to relocation assistance for economically displaced tenants; CB 120162: establishing a new 15th Avenue East Business Improvement Area (BIA); Appointments and Reappointments to Seattle Women's Commission; CB 120153: relating to land use and zoning - small lots in Downtown Mixed Residential; CB 120178: amending 2021 Budget.\n0:00 Call to order\n2:14 Presentations - Mayor Jenny A. Durkan's Proposed 2022 Budget \n4:09 Presentations \n27:28 Public Comment \n1:31:35 Payment of Bills \n1:32:35 CF 314485: Mayor Jenny A. Durkan's Budget Address on the 2022 Budget -\n1:34:00 CB 120157: relating to affordable housing \n2:13:18 Appointments and Reappointments \n2:16:25 CB 120153: relating to land use and zoning \n2:21:34 CB 119585: relating to residential rental properties \n2:31:17 CB 120173: relating to relocation assistance for economically displaced tenants \n2:56:35 CB 120162: establishing a new 15th Avenue East BIA \n2:59:36 Appointments and Reappointments \n3:01:55 CB 120173: 2021 Budget", "publish_date": "2021-09-27T00:00:00"}