{"title": "Seattle City Council 2/1/2021", "video_id": "0ynuLuqULgc", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; Appointment of Curry Mayer, Director of the Office of Emergency Management; CB 119982: relating to the Seattle Commission for People with Disabilities; Appointments and Reappointments to Seattle Women's Commission, Seattle LGBTQ Commission, Seattle Commission for People with Disabilities, Seattle Housing Authority Board, Community Roots Housing Public Development Authority Governing Council, Labor Standards Advisory Commission; CB 119992: relating to Seattle's construction codes; CB 119993: relating to Seattle's construction codes - Seattle Energy Code; CF 314461: Application of Martin Liebowitz and 34th and Spring, LLC; CB 119987 approving the extension of a contract rezone; Res 31987 membership to the Association of Washington Cities Risk Management Service Agency; Appointments and Reappointments to Seattle Renters' Commission.\nAdvance to a specific part\nPublic Comment - 1:41\nPayment of Bills - 37:59\nAppointment of Curry Mayer, Director of the Office of Emergency Management - 39:02\nCB 119982: relating to the Seattle Commission for People with Disabilities - 45:25\nAppointments and Reappointments - 47:41\nCB 119992: relating to Seattle's construction codes - 1:01:11\nCB 119993: relating to Seattle's construction codes - Seattle Energy Code - 1:10:03\nCF 314461: Application of Martin Liebowitz and 34th and Spring, LLC - 1:24:17\nCB 119987: approving the extension of a contract rezone - 1:26:56\nRes 31987: membership to the Association of Washington Cities Risk Management Service Agency - 1:30:11\nAppointments and Reappointments - 1:33:13", "publish_date": "2021-02-01T00:00:00"}