{"title": "Seattle City Council 9/13/2022", "video_id": "5nD7Qf2xU00", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nAgenda: Call to Order, Roll Call, Presentations; Public Comment; Adoption of Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar; CF 314504: Report of the City Clerk on the Certificate of Sufficiency for Initiative No. 135; CF 314501: Office of Inspector General request for an extension for the filing of September 2022 Annual Surveillance Technologies review reports; Res 32066: celebrating the fiftieth anniversary of the adoption of the Discovery Park Master Plan; CB 120414: relating to the redevelopment of Yesler Terrace the Housing Authority of The City of Seattle; CB 120413: amending Ordinance 126490, which adopted the 2022 Budget; CB 120415: relating to Seattle Parks and Recreation (SPR); Appointment of Greg Spotts, Director of Seattle Department of Transportation; CB 120380: accepting various deeds for street or alley purposes; CB 120381: accepting 21 limited purpose easements for public sidewalk and alley turn-around purposes; CB 120382: accepting various deeds for street or alley purposes; laying off, opening, widening, extending, and establishing portions of rights of way; CB 120383: accepting various deeds for street or alley purposes; laying off, opening, widening, extending, and establishing portions of rights-of-way; CB 120403: accepting various deeds for street or alley purposes; laying off, opening, widening, extending, and establishing portions of rights-of-way; CB 120404: accepting twenty-five limited purpose easements for public sidewalk and alley turn-around purposes; Items Removed From Consent Calendar, Adoption of Other Resolutions, Other Business.\n0:00 Call to Order\n0:56 Public Comment \n24:22 Adoption of Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar \n26:30 CF 314504: Initiative No. 135 \n29:50 CF 314501: 2022 Annual Surveillance Technologies review reports \n33:06 Res 32066: Discovery Park Master Plan \n37:20 CB 120414: Yesler Terrace \n43:29 CB 120413: amending Ordinance 126490, which adopted the 2022 Budget \n57:46 CB 120415: relating to Seattle Parks and Recreation \n1:00:29 Appointment of Greg Spotts, Director of SDOT \n1:07:59 CB 120380, CB 120381, CB 120382, CB 120383, CB 120403, and CB 120404: accepting various deeds and easements", "publish_date": "2022-09-13T00:00:00"}