{"title": "City Council 9/20/22", "video_id": "4M3vuMqm4Tk", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\nAgenda: Call to Order, Roll Call, Presentations; Public Comment; Adoption of Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar; Appointments and reappointments; CF 314504: Report on Initiative No. 135, concerning establishment of Seattle Social Housing Public Development Authority (PDA); Res 32069: Resolution regarding Initiative 135 and enabling proposed Initiative Measure to appear on February 14, 2023, ballot; Appt 02332: Appointment of Gino Betts Jr. as Director of the Office of Police Accountability; Appt 02381: Appointment of Faisal Khan as Director of Public Health Seattle and King County; Appt 02348: Appointment of Kimberly Loving as Director of the Seattle Department of Human Resources; CB 120411: Ordinance relating to the City Light Department rates; CB 120412: Ordinance relating to the establishment of the Seattle Film Commission; Res 32068: Resolution relating to proposed Comprehensive Plan amendments; CB 120398: Ordinance relating to the 2018 Families, Education, Preschool, and Promise Levy;Items Removed From Consent Calendar, Adoption of Other Resolutions, Other Business.\n\n0:00 Call to Order\n2:50 Public Comment\n1:11:35 Adoption of Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar \n1:13:48 CF 314504: Report on Initiative No. 135, concerning establishment of Seattle Social Housing Public Development Authority (PDA) \n1:15:02 Res 32069: Resolution regarding Initiative 135 and enabling Initiative Measure to appear on 2/14/23 ballot \n1:17:35 Appt 02332: Appointment of Gino Betts Jr. as Director of the Office of Police Accountability \n1:31:40 Appt 02381: Appointment of Faisal Khan as Director of Public Health Seattle and King County \n1:37:16 Appt 02348: Appointment of Kimberly Loving as Director of the Seattle Department of Human Resources \n1:41:33 CB 120411: Ordinance relating to the City Light Department rates \n1:48:49 CB 120412: Ordinance relating to the establishment of the Seattle Film Commission \n1:58:16 Res 32068: Resolution relating to proposed Comprehensive Plan amendments \n2:01:28 CB 120398: Ordinance relating to the 2018 Families, Education, Preschool, and Promise Levy", "publish_date": "2022-09-20T00:00:00"}