{"title": "Seattle City Council 8/17/2020", "video_id": "Usa8_Ya_Ggc", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "In-person attendance is currently prohibited per Washington State Governor's Proclamation No. 20-28.8 through September 1, 2020. Meeting participation is limited to access by telephone conference line and Seattle Channel online.\n\nAgenda: Public Comment; Payment of Bills; CB 119831: relating to land use and zoning - child care centers; CB 119840: named in honor of MiChance Dunlap-Gittens and relating to the Seattle Police Department; Res 31963: supporting The George Floyd Justice in Policing Act of 2020; CB 119844: vacating portions of the alleys on petition of The Whitaker condominium association; CB 119844: relating to a pedestrian skybridge over and across Sixth Avenue - MPH Pacific Place LLC; CB 119845: granting Onni DEU (John Street) LLC permission for a below-grade private thermal energy exchange system under and across John Street; CB 119846: granting SMRE Marketside LLC permission to maintain and operate a pedestrian skybridge over and across Post Alley; CB 119850: relating to Department of Transportation - right-of-way; CB 119851: accepting various deeds for street or alley purposes; CB 119852: accepting twenty limited purpose easements; CB 119853: accepting various deeds for street or alley purposes; CB 119854: accepting various deeds for street or alley purposes; CB 119855: accepting twenty limited purpose easements; CB 119856: accepting various deeds for street or alley purposes; CB 119857: relating to the City Light Department; CB 119859: relating to taxation - heating oil tax;  CB 119847: relating to historic preservation - Canterbury Court; CB 119848: relating to historic preservation - University of Washington Engineering Annex; CB 119849: relating to historic preservation - Roy Vue Apartments; Res 31964: King County Regional Homelessness Authority; Res 31965: Hearing Examiner and the final assessment roll for Local Improvement District No. 6751; Appointments and Reappointments.\n\nAdvance to a specific part\nPublic Comment - 8:18\nPayment of Bills - 56:43\n119831: relating to land use and zoning - child care centers - 57:45\nCB 119840: named in honor of MiChance Dunlap-Gittens and relating to the Seattle Police Department - 1:03:30\nRes 31963: supporting The George Floyd Justice in Policing Act of 2020 - 1:18:32\nCB 119844: vacating portions of the alleys on petition of The Whitaker condominium association - 1:21:54\nCB 119844: relating to a pedestrian skybridge over and across Sixth Avenue - MPH Pacific Place LLC - 1:26:40\nCB 119845: granting Onni DEU (John Street) LLC permission for a below-grade private thermal energy exchange system under and across John Street - 1:28:21\nCB 119846: granting SMRE Marketside LLC permission to maintain and operate a pedestrian skybridge over and across Post Alley - 1:30:18\nCB 119850, CB 119851, CB 119852, CB 119853, CB 119854, CB 119855, CB 119856: relating to Department of Transportation - accepting deeds and easements - 1:32:02\nCB 119857: relating to the City Light Department - 1:41:14\nCB 119859: relating to taxation - heating oil tax - 1:44:05\nCB 119847: relating to historic preservation - Canterbury Court - 1:52:25\nCB 119848: relating to historic preservation - University of Washington Engineering Annex - 1:54:20\nCB 119849: relating to historic preservation - Roy Vue Apartments - 1:56:54\nRes 31964: King County Regional Homelessness Authority - 1:59:02\nRes 31965: Hearing Examiner and final assessment roll for Local Improvement District No. 6751 - 2:01:06\nAppointments and Reappointments - 2:07:14\n\nView the City of Seattle's commenting policy: seattle.gov/online-comment-policy", "publish_date": "2020-08-17T00:00:00"}