{"title": "Seattle City Council 5/24/2022", "video_id": "RKnxFN1u044", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\nPursuant to Washington State Governor's Proclamation No. 20-28.15 and Senate Concurrent Resolution 8402, this public meeting will be held remotely. Meeting participation is limited to access by the telephone number provided on the meeting agenda, and the meeting is accessible via telephone and Seattle Channel online.\n\nAgenda: Call to Order, Roll Call, Presentations, Adoption of Introduction and Referral Calendar; Approval of Consent Calendar; Approval of the Agenda; Public Comment; CB 120324: amending Ordinance 126490, the 2022 Budget; CB 120327: relating to the City Light and Seattle Public Utilities Departments - interest on delinquent utility consumption and utilization accounts; CB 120328: relating to City Light Department - emergency bill assistance program; CB 120329: relating to Seattle Public Utilities' Emergency Assistance Program; CB 120316: amending Ordinance 126490, the 2022 Budget; CB 120317: amending Ordinance 126237, the 2021 Budget; CB 120318: relating to appropriations for the Executive Department; CB 120320: relating to appropriations for the Seattle Police Department; Res 32050: relating to the Seattle Police Department; CB 120300: granting permission to 2001 Sixth, L.L.C. for a utility tunnel; CB 120301: granting King County permission for two pedestrian tunnels; CB 120302: granting Swedish Health Services permission for pedestrian skybridge; Res 32053: granting conceptual approval for private communication conduit; CB 120330: relating to just cause eviction.\n0:00 Call to Order\n1:28 Presentations - Proclaiming May Mental Health Awareness Month\n11:27 Presentations - Proclaiming May 29 Pride Asia Day\n18:12 Adoption of IRC, Approval of Consent Calendar, Agenda\n26:21 Public Comment\n52:28 CB 120324: amending Ordinance 126490, the 2022 Budget\n56:04 CB 120327: relating to City Light and Seattle Public Utilities\n58:14 CB 120328: relating to City Light emergency bill assistance program\n1:00:53 CB 120329: relating to SPU Emergency Assistance Program\n1:04:35 CB 120316: amending the 2022 Budget; CB 120317: amending the 2021 Budget\n1:09:34 CB 120318: relating to appropriations for the Executive Department\n1:15:19 Res 32050: relating to the Seattle Police Department\n1:50:42 CB 120320: relating to appropriations for the Seattle Police Department\n2:12:40 CB 120300: granting permission to 2001 Sixth, L.L.C. for a utility tunnel\n2:14:16 CB 120301: granting King County permission for two pedestrian tunnels\n2:15:45 CB 120302: granting Swedish Health Services permission for pedestrian skybridge\n2:17:22 Res 32053: granting conceptual approval for private communication conduit\n2:19:04 CB 120330: relating to just cause eviction", "publish_date": "2022-05-24T00:00:00"}