{"title": "Seattle City Council Transportation & Utilities Committee 4/7/21", "video_id": "wSjJznmG0pM", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28, et. seq., until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\n\nAgenda: Call To Order, Approval of the Agenda; Public Comment; CB 120013: relating to the Department of Transportation - Lake City Living Memorial Triangle; Reappointments to Seattle Pedestrian Advisory Board; CB 120014: relating to the City Light Department and Seattle Public Utilities - Georgetown Steam Plant flume property; Res 32000: Seattle Public Utilities 2021-2026 Strategic Business Plan; 2021 Technology Matching Fund Report; CB 120024: relating to surveillance technology implementation - Seattle Police Department 911 Logging Recorder; CB 120025: relating to surveillance technology implementation - Seattle Police Department Automated License Plate Reader; CB 120026: relating to surveillance technology implementation - Seattle Police Department Parking Enforcement Systems; CB 120027: relating to surveillance technology implementation - Seattle Police Department Computer-Aided Dispatch; CB 120028: relating to surveillance technology implementation - Seattle Police Department CopLogic.\nAdvance to a specific part\nPublic Comment - 2:02\nCB 120013: relating to the Department of Transportation - Lake City Living Memorial Triangle - 6:36\nReappointments - 24:26\nCB 120014: Georgetown Steam Plant flume property - 28:35\nRes 32000: Seattle Public Utilities 2021-2026 Strategic Business Plan - 36:13\n2021 Technology Matching Fund Report - 1:27:14\nCB 120024: relating to surveillance technology - SPD 911 Logging Recorder - 1:41:21\nCB 120025: relating to surveillance technology - SPD Automated License Plate Reader - 1:50:06\nCB 120026: relating to surveillance technology - SPD Parking Enforcement Systems - 2:01:35\nCB 120027: relating to surveillance technology - SPD Computer-Aided Dispatch - 2:06:48\nCB 120028: relating to surveillance technology - SPD CopLogic - 2:09:56", "publish_date": "2021-04-07T00:00:00"}