{"title": "Seattle City Council 9/21/2020", "video_id": "IeXgsuQ1FdA", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation No. 20-28.9 through October 1, 2020. Meeting participation is limited to access by telephone conference line and Seattle Channel online.\n\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of Introduction and Referral Calendar, and Approval of the Agenda; Public Comment; Payment of Bills; CB 119881: relating to renovating KeyArena at Seattle Center; CF 314457: Office of City Auditor's request for a one-year suspension of a citywide financial condition report; CB 119889: relating to historic preservation; Res 31933: adding impacts of climate change to requirements for new legislation; CB 119886: transfer of City property at 722 18th Avenue; CB 119887: relating to Equitable Development Initiative; Appointments and Reappointments to Seattle LGBTQ Commission, Seattle Commission for People with Disabilities, Seattle Arts Commission, Seattle Music Commission, Seattle Human Rights Commission, Seattle Women's Commission; CB 119879: relating to a emergency public safety radio communication system; CB 119883: Madison BRT - RapidRide G Line project; CB 119857: relating to City Light Department - Diablo and Newhalem communities; CB 119870: relating to the City Light Department - Boundary Hydroelectric Project; CB 119871: relating to City Light Department - net metering; CB 119885: relating to City Light Department - voluntary renewal energy program;  Res 31968: honorary designation of \"Douglas Q. Barnett Street\"; Res 31969: Relating to the appeal of Lou Bond.\nAdvance to a specific part:\nPresentation - Proclamation Diaper Need Awareness Week - 1:30\nPublic Comment - 16:25\nPayment of Bills - 57:00\nCB 119881: relating to renovating KeyArena at Seattle Center - 58:09\nCF 314457: one-year suspension of a citywide financial condition report - 1:01:58\nCB 119889: relating to historic preservation - 1:05:05\nRes 31933: adding impacts of climate change to requirements for new legislation - 1:07:29\nCB 119886: transfer of City property at 722 18th Ave. - 1:16:06\nCB 119887: relating to Equitable Development Initiative - 1:24:01\nAppointments and Reappointments - 1:27:44\nCB 119879: relating to a emergency public safety radio communication system - 1:40:32\nCB 119883: Madison BRT - RapidRide G Line project - 1:42:51\nCB 119857: relating to City Light - Diablo and Newhalem communities - 1:53:37\nCB 119870: relating to City Light - Boundary Hydroelectric Project - 1:55:23\nCB 119871: relating to City Light - net metering - 1:57:16\nCB 119885: relating to City Light - voluntary renewal energy program - 1:59:01\nRes 31968: honorary designation of \"Douglas Q. Barnett Street\" - 2:00:47\nRes 31969: Relating to the appeal of Lou Bond - 2:04:28", "publish_date": "2020-09-21T00:00:00"}