{"title": "Seattle City Council 5/10/2021", "video_id": "mRa8XRqbhzo", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\n\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; Appointment and Reappointments to the Working Group for Performance Auditing, Community Involvement Commission, Design Review Board; CB 120039: amending Ordinance 126237, the 2021 Budget; CB 120058: relating to the Office of Housing (OH); CB 120059: relating to funding for housing and community development programs; Appointments and Reappointments to Labor Standards Advisory Commission, Domestic Workers Standards Board; CB 120048: relating to the City-owned real property known as the Red Barn Ranch; CB 120050: relating to Seattle Parks and Recreation - Southwest Youth and Family Services; CB 120033: Seattle Parks and Recreation - Helene Madison Pool (Ingraham High School) and Southwest Teen Life Center and Pool (Chief Sealth High School); Appointments and Reappointments to Seattle Indian Services Commission Governing Council, Washington State Convention Center Public Facilities District Board, Seattle Public Library Board; CB 120042: amending Ordinance 126237, the 2021 Budget; CB 120045: relating to the City Light Department; CB 120062: relating to the Madison Bus Rapid Transit (BRT); CB 120063: relating to grant funds from U.S. Department of Transportation; Res 32000: relating to Seattle Public Utilities - 2021-2026 Strategic Business Plan.\nAdvance to a specific part\nPresentations - Proclamation - Affordable Housing Week - 0:43\nPublic Comment - 10:13\nPayment of Bills - 23:10\nAppointment and Reappointments - 24:11\nCB 120039: amending Ordinance 126237, the 2021 Budget - 32:08\nCB 120058: Office of Housing (OH) land transfer - 34:26\nCB 120059: funding for housing and community development programs - 43:11\nAppointments and Reappointments - 45:54\nCB 120048: City-owned real property - the Red Barn Ranch - 53:10\nCB 120050: Seattle Parks and Recreation - Southwest Youth and Family Services - 56:31\nCB 120033: Seattle Parks and Recreation - Helene Madison Pool and Southwest Teen Life Center and Pool - 58:00\nAppointments and Reappointments - 59:50\nCB 120042: amending Ordinance 126237, the 2021 Budget - 1:04:57\nCB 120045: City Light Department - 1:16:08\nCB 120062: Madison Bus Rapid Transit (BRT) - 1:18:06\nCB 120063: grant funds from U.S. Department of Transportation - 1:20:27\nRes 32000: Seattle Public Utilities 2021-2026 Strategic Business Plan - 1:21:41", "publish_date": "2021-05-10T00:00:00"}