{"title": "Seattle City Council 12/6/2021", "video_id": "Ms8XffeJqhk", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nPursuant to Washington State Governor's Proclamation No. 20-28.15 and Senate Concurrent Resolution 8402, this public meeting will be held remotely. Meeting participation is limited to access by the telephone number provided on the meeting agenda, and the meeting is accessible via telephone and Seattle Channel online.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120213: relating to land use and zoning, includes public hearing; CB 120236: relating to City streets - Lenny Wilkens Way; CB 120231: relating to City employment - collective bargaining agreement; CB 120237: relating to City employment - Fourth Quarter 2021 Employment Ordinance; CB 120233: relating to the City Light Department - Rate Stabilization Account in 2021; Res 32031: ratifying the 2021 Update to the Green/Duwamish and Central Puget Sound Watershed or Water Resource Inventory Area (WRIA 9) Salmon Habitat Plan, Making Our Watershed Fit for a King; Res 32030: relating to the City Light Department - biennial energy conservation target; Appointments to Seattle Bicycle Advisory Board, Seattle Transit Advisory Board, Seattle School Traffic Safety Committee.\n0:00 Call to order\n2:18 Public Comment\n11:29 Payment of Bills\n12:39 CB 120213: relating to land use and zoning\n20:40 CB 120236: relating to City streets - Lenny Wilkens Way\n22:54 CB 120231: City employment - collective bargaining agreement\n25:21 CB 120237: City employment - Fourth Quarter 2021 Employment Ordinance\n27:34 CB 120233: City Light Department - Rate Stabilization Account\n30:24 Res 32031: Salmon Habitat Plan\n34:28 Res 32030: City Light Department - biennial energy conservation target\n36:37 Appointments", "publish_date": "2021-12-06T00:00:00"}