{"title": "Seattle City Council Special Meeting 9/29/2020", "video_id": "xHXW7je6BMU", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nThis meeting is a rescheduled meeting of the regular City Council meeting of September 28, 2020. In-person attendance is currently prohibited per Washington State Governor's Proclamation No. 20-28.9 through October 1, 2020. Meeting participation is limited to access by telephone conference line and Seattle Channel online.\n\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CF 314460: Mayor Jenny A. Durkan's Budget Address on the 2021 Budget; CB 19888: relating to City employment; CB 119882: permits Seattle Police Department's Harbor Patrol use of Waterway 20; CB 119896: relating to City Light and Seattle Public Utilities; CB 119897: traffic safety cameras; CF 314458: Office of City Auditor's request for extension; Appointments and Reappointments to Pike Place Market Historical Commission, Urban Forestry Commission, International Special Review District Board, Seattle Municipal Court, Public Safety Civil Service Commission; CB 119893: relating to Seattle whistleblower protection code; CB 119876: relating to transportation network company driver labor standards; CB 119890: relating to the transfer of City real property for housing development - 7750 28th Ave NW; CB 119838: relating to land use and zoning - Seattle Comprehensive Plan; Res 31970: identifying proposed Comprehensive Plan amendments for 2021; Res 31972: Hearing Examiner Case No. CWF-0022.\nAdvance to a specific part:\nPresentation: Delivery of Mayor Jenny A. Durkan's 2021 Budget - 0:56\nPublic Comment - 3:36\nPayment of Bills - 41:42\nCF 314460: Mayor Jenny A. Durkan's Budget Address on the 2021 Budget - 43:13\nCB 19888: relating to City employment - 45:38\nCB 119882: permits Seattle Police Department's Harbor Patrol use of Waterway 20 - 47:26\nCB 119896: relating to City Light and Seattle Public Utilities - 52:09\nCB 119897: traffic safety cameras - 56:09\nCF 314458: Office of City Auditor's request for extension - 1:02:34\nAppointments and Reappointments - 1:04:20\nCB 119893: relating to Seattle whistleblower protection code - 1:17:57\nCB 119876: relating to transportation network company driver labor standards - 1:21:54\nCB 119890: relating to the transfer of City real property for housing development - 7750 28th Ave NW - 1:41:53\nCB 119838: relating to land use and zoning - Seattle Comprehensive Plan - 1:48:52\nRes 31970: identifying proposed Comprehensive Plan amendments for 2021 - 1:57:36\nRes 31972: Hearing Examiner Case No. CWF-0022 - 2:09:36", "publish_date": "2020-09-29T00:00:00"}