{"title": "Seattle City Council 6/1/2021", "video_id": "S00JyhNONtM", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120080: related to land use and zoning, includes public hearing; CB 120089: relating to the City Light and Seattle Public Utilities Departments; CB 120087: relating to appropriations for the Seattle Office for Civil Rights; Appointments and Reappointments to Community Involvement Commission, Urban Forestry Commission, Seattle Design Commission; CB 119981: amending Ordinance 126237, which adopted the 2021 Budget; CB 120086: relating to the transfer of City property - Phinney Neighborhood Association; CB 120084: relating to land disturbing activity; CB 120083: relating to Seattle's construction codes; CB 120085: relating to boiler and steam engine operations; Appointment to Pike Place Market Preservation and Development Authority Governing Council.\nAdvance to a specific part\nPresentation - Proclamation - National Gun Violence Awareness Day - 1:35\nPublic Comment - 12:58\nPayment of Bills - 1:22:13\nCB 120080: related to land use and zoning, includes public hearing - 1:23:19\nCB 120089: relating to the City Light and Seattle Public Utilities Departments - 1:27:10\nCB 120087: relating to appropriations for the Seattle Office for Civil Rights - 1:29:55\nAppointments and Reappointments to Community Involvement Commission, Urban Forestry Commission, Seattle Design Commission - 1:40:20\nCB 119981: amending Ordinance 126237, which adopted the 2021 Budget - 1:45:39\nCB 120086: relating to transfer of City property - Phinney Neighborhood Association - 3:00:23\nCB 120084: relating to land disturbing activity - 3:03:25\nCB 120083: relating to Seattle's construction codes - 3:06:08\nCB 120085: relating to boiler and steam engine operations - 3:07:59\nAppointment to Pike Place Market Preservation and Development Authority Governing Council - 3:10:00", "publish_date": "2021-06-02T00:00:00"}