{"title": "City Council 9/26/23", "video_id": "sQ0n1rXVRas", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nAgenda: Call to Order, Roll Call, Presentations; Public Comment; Adoption of the Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar; Appointment of Marshall Foster to Director of Seattle Center; CB 120644: Relating to Seattle Parks work at the Duwamish Waterway Park; CB 120648: Relating to Seattle Parks and property at 9200 18th Ave SW; CB 120664: Relating to Bell St. Park, Occidental Square, Pioneer Square and Westlake Park; CB 120667: Relating to Seattle Parks and Second Amendment to the Easement Agreement; CB 120663: Relating to Department of Finance and Administrative Services and Seattle Fire Department; CB 120666: Relating to Seattle Department of Transportation and Cultural Space Agency; CF 314525: Mayor Bruce Harrell’s Budget Address; CB 120632: Relating to Official Land Use Map; Res 32113: Philippine Human Rights Act resolution; CB 120657: Relating to rates and charges for water services of Seattle Public Utilities; Res 32110: Relating to One Roof Partnership and new world-class Memorial Stadium; Other Business.\n\n0:00 Call to Order\n1:28 presentations \n24:00 Public Comment \n1:08:49 Adoption of the Introduction and Referral Calendar, Approval of the Agenda, Approval of Consent Calendar \n1:13:40 Appointment of Marshall Foster to Director of Seattle Center \n1:19:16 CB 120644: Relating to Seattle Parks work at the Duwamish Waterway Park \n1:20:17 CB 120648: Relating to Seattle Parks and property at 9200 18th Ave SW \n1:22:34 CB 120664: Relating to Bell St. Park, Occidental Square, Pioneer Square and Westlake Park \n1:26:37 CB 120667: Relating to Seattle Parks and Second Amendment to the Easement Agreement \n1:29:08 CB 120663: Relating to Department of Finance and Administrative Services and Seattle Fire Department \n1:32:24 CB 120666: Relating to Seattle Department of Transportation and Cultural Space Agency \n1:37:31 CF 314525: Mayor Bruce Harrell’s Budget Address \n1:39:16 CB 120632: Relating to Official Land Use Map \n2:03:02 Res 32113: Philippine Human Rights Act resolution \n2:09:00 CB 120657: Relating to rates and charges for water services of Seattle Public Utilities \n2:12:31 Res 32110: Relating to One Roof Partnership and new world-class Memorial Stadium \n2:22:36 Other Business", "publish_date": "2023-09-26T00:00:00"}