{"title": "Seattle City Council 8/16/21", "video_id": "B6072Z5g9XY", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CF 314482: Office of City Auditor extension request - reports on Seattle Department of Transportation Surveillance Technology Usage on License Plate Reader (LPR) technology and Closed Circuit Television Traffic Cameras (CCTV) technology; CF 314483: Seattle Information Technology Department extension request - Group 4 Surveillance Impact Report (SIR) report; CF 314484: Revised Master List of Technologies; CB 120144: relating to City employment, adopting a 2021 Citywide Position List; Appointment of Jeffrey G. Berry as member, Joint Apprenticeship Training Committee; CB 120105: relating to Seattle Police Department - banning the ownership, purchase, rent, storage, or use of less lethal weapons; CB 120148: relating to parking enforcement - transferring positions out of Seattle Police Department; CB 120121: relating to land use and zoning - occupancy of street-level spaces downtown; Appointments and reappointments to Seattle Women's Commission, Seattle Music Commission, Seattle Human Rights Commission, Cultural Space Agency Public Development Authority Governing Council; Res 32018: supporting the creation of a United States Truth and Healing Commission on Indian Boarding Schools and other actions to address the lasting harm of Indian boarding schools.\nAdvance to a specific part\nPresentation - Proclamation - Black Philanthropy Month - 0:43\nPublic Comment - 13:48\nPayment of Bills - 30:13\nRes 32018: United States Truth and Healing Commission on Indian Boarding Schools - 31:12\nCF 314482: Office of City Auditor extension request - 34:45\nCF 314483: Seattle Information Technology Department extension request - 37:13\nCF 314484: Revised Master List of Technologies - 39:46\nCB 120144: relating to City employment, adopting a 2021 Citywide Position List - 41:23\nAppointment to Joint Apprenticeship Training Committee - 42:52\nCB 120105: relating to Seattle Police Department - 44:35\nCB 120148: relating to parking enforcement - 1:07:55\nCB 120121: relating to land use and zoning - occupancy of street-level spaces downtown - 1:11:50\nAppointments and reappointments - 1:28:41", "publish_date": "2021-08-16T00:00:00"}