{"title": "Seattle City Council Transportation & Utilities Committee 9/15/21", "video_id": "BWEO9gGgzpY", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28, et. seq., until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call To Order, Approval of the Agenda; Public Comment; CB 120160: relating to the City Light Department - Renewable Plus Program; CB 120170: relating to the City Light Department - Skagit Habitat Enhancement Program; CB 120161: relating to Seattle Public Utilities water regulations; CB 120175: authorizing Seattle Public Utilities to execute agreements; CB 120174: University of Washington underground pedestrian concourse tunnel; Res 32019: honorary designation of Thomas St between 1st Ave N and 2nd Ave N as \"Lenny Wilkens Way\"; Presentation: Seattle Department of Transportation's Use of Acyclica Technology; CB 120171: relating to surveillance technology implementation - Seattle Fire Department's use of Emergency Scene Cameras and Hazardous Materials Cameras.\nAdvance to a specific part\n0:00 Call to order\n2:39 CB 120160: City Light Department - Renewable Plus Program\n17:38 CB 120170: City Light Department - Skagit Habitat Enhancement Program\n44:24 CB 120161: Seattle Public Utilities water regulations\n54:29 CB 120175: authorizing Seattle Public Utilities to execute agreements\n1:15:51 CB 120174: UW underground pedestrian concourse tunnel\n1:23:22 Res 32019: honorary designation - \"Lenny Wilkens Way\"\n1:28:41 Presentation: Seattle Department of Transportation's Use of Acyclica Technology\n1:39:17 CB 120171: relating to surveillance technology implementation - Seattle Fire", "publish_date": "2021-09-15T00:00:00"}