{"title": "Seattle City Council Finance & Neighborhoods Committee 12/11/2019", "video_id": "EdV7fAGvhpI", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "Agenda: Public Comment; Appointments and Reappointments to Community Involvement Commission, Pike Place Market Preservation and Development Authority Governing Council, Pike Place Market Historical Commission, and Landmarks Preservation Board; CB 119725: relating to City employment - a compensation program for the position of Chief Technology Officer; CB 119716: relating to City employment - Fourth Quarter 2019 Employment Ordinance; Human Services Department's Draft Annual Action Plan for Federal Funds; CB 119711: relating to the Department of Finance and Administrative Services - lease for 5821 First Ave. South; CB 119712: relating to the Department of Finance and Administrative Services; CB 119721: acceptance of funding from non-City sources; CB 119720: 2019 Budget & 2019-2024 Capital Improvement Program.\r\nAdvance to a specific part\nPublic Comment - 2:41\nAppointments and Reappointments to Community Involvement Commission, Pike Place Market Preservation and Development Authority Governing Council, Pike Place Market Historical Commission, and Landmarks Preservation Board - 6:35\nCB 119725: relating to City employment - a compensation program for the position of Chief Technology Officer - 28:02\nCB 119716: relating to City employment - Fourth Quarter 2019 Employment Ordinance - 49:25\nHuman Services Department's Draft Annual Action Plan for Federal Funds, including public hearing - 55:25\nCB 119711: relating to the Department of Finance and Administrative Services - lease for 5821 First Ave. South - 1:01:16\nCB 119712: relating to the Department of Finance and Administrative Services and Seattle Department of Transportation - 1:08:52\nCB 119721: acceptance of funding from non-City sources - 1:17:45\nCB 119720: 2019 Budget and 2019-2024 Capital Improvement Program - 1:21:57", "publish_date": "2019-12-11T00:00:00"}