{"title": "Seattle City Council 6/14/21", "video_id": "eE-M5v6XEe0", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120096: relating to appropriations for the Human Services Department; Appointments and Reappointments to Seattle Chinatown International District Preservation and Development Authority Governing Council; CF 314476: Findings, Conclusions, and Decision of the City Council of the City of Seattle In the Matter of the Final Assessment Roll for Local Improvement District No. 6751 (Waterfront LID) and the Appeals of Multiple Appellants; CB 120072: final assessments and assessment roll of Local Improvement District (LID) No. 6751; CB 120073: relating to financing public improvements within Local Improvement District No. 6751; CB 120051: relating to public assets, land use, and zoning - Center Campus Subarea; CB 120032: relating to Woodland Park; CB 120069: relating to independent contractors in Seattle; CB 120092: relating to the regulation of food delivery businesses and platforms; Appointments and Reappointments to Seattle LGBTQ Commission, Seattle Disability Commission, Seattle Music Commission, Districting Commission, Families, Education, Preschool and Promise Levy Oversight Committee.Advance to a specific part\nPublic Comment - 1:15\nPayment of Bills - 21:15\nCB 120096: relating to appropriations for the Human Services Department - 22:13\nAppointments and Reappointments - 45:44\nCF 314476, CB 120072, and CB 120073: Local Improvement District No. 6751 (Waterfront LID) - 48:45\nCB 120051: relating to Center Campus Subarea - 1:01:02\nCB 120032: relating to Woodland Park - 1:03:10\nCB 120069: relating to independent contractors in Seattle - 1:06:04\nCB 120092: relating to the regulation of food delivery businesses and platforms - 1:15:00\nAppointments and Reappointments. - 1:19:43", "publish_date": "2021-06-14T00:00:00"}