{"title": "Seattle City Council 4/19/21", "video_id": "DxDEuC4TLPo", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n\nIn-person attendance is currently prohibited per Washington State Governor's Proclamation 20-28.15, until the COVID-19 State of Emergency is terminated or Proclamation 20-28 is rescinded by the Governor or State legislature. Meeting participation is limited to access by telephone conference line and online by the Seattle Channel.\nAgenda: Call to Order, Roll Call, Presentations, Approval of the Journal, Adoption of the Introduction and Referral Calendar, Approval of the Agenda; Public Comment; Payment of Bills; CB 120034: relating to City employment - PROTEC17 Strategic Advisor-Legislative Bargaining Unit; CB 120035: relating to the City Light Department - emergency bill assistance program; CB 120036: Seattle Public Utilities' Emergency Assistance Program; Res 32002: supporting renewal of King County's Best Starts for Kids Levy; Appointments to Seattle Ethics and Elections Commission; Appointments to Community Police Commission; CB 120024: relating to surveillance technology implementation - 911 Logging Recorder; CB 120025: relating to surveillance technology implementation - Automated License Plate Reader; CB 120026: relating to surveillance technology implementation - Parking Enforcement Systems; CB 120027: relating to surveillance technology implementation - Computer-Aided Dispatch; CB 120028: relating to surveillance technology implementation -  CopLogic.\nAdvance to a specific part\nPresentation - Proclamation honoring Khoa Pham - 0:47\nPublic Comment - 7:03\nPayment of Bills - 17:46\nCB 120034: relating to City employment - 19:12\nCB 120035: City Light Department emergency bill assistance program - 25:28\nCB 120036: Seattle Public Utilities' Emergency Assistance Program - 28:00\nRes 32002: supporting renewal of King County's Best Starts for Kids Levy - 30:40\nAppointments to Seattle Ethics and Elections Commission - 34:38\nAppointments to Community Police Commission - 38:40\nCB 120024: surveillance technology implementation - 911 Logging Recorder - 41:42\nCB 120025: surveillance technology implementation - Automated License Plate Reader - 50:48\nCB 120026: surveillance technology implementation - Parking Enforcement Systems - 55:12\nCB 120027: surveillance technology implementation - Computer-Aided Dispatch - 57:04\nCB 120028: surveillance technology implementation - CopLogic - 58:52\nOther Business: Letter relating to improving community health by further divesting from incarceration - 1:02:33", "publish_date": "2021-04-19T00:00:00"}