{"title": "Seattle City Council 6/28/22", "video_id": "DYYM8mLoXls", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "View the City of Seattle's commenting policy: seattle.gov/online-comment-policy\nAgenda: Call to Order, Roll Call, Presentations; Public Comment; Adoption of Introduction and Referral Calendar, Approval of Consent Calendar, Approval of the Agenda; CF 314495: Report of the City Clerk on the Certificate of Sufficiency for Initiative No. 134; CB 120342: authorizing Seattle Parks and Recreation to enter into an agreement with Seattle Preparatory School to replace the Montlake Playfield; CB 120351: relating to City employment; Appointment of Andrew Lee as General Manager (GM) and Chief Executive Officer (CEO) of Seattle Public Utilities (SPU); CB 120345: vacating a portion of 29th Ave SW and SW City View St.; CB 120346: relating to Seattle Public Utilities (SPU) - construction easement; CB 120349: relating to the City Light Department - Treaty between the U.S. and Canada relating to the Skagit River and Ross Lake; CB 120343: relating to housing for low-income households - amended Housing Funding Policies; CB 120338: relating to grant funds from non-City sources; CB 120340: relating to the Department of Finance and Administrative Services (FAS) - real property lease with Washington State Department of Transportation (WSDOT); Items removed from consent calendar; adoption of other resolutions; other business.\n0:00 Call to Order\n1:00 Public Comment \n27:19 Adoption of Introduction and Referral Calendar, Approval of Consent Calendar, Approval of the Agenda\n29:50 CF 314495: Initiative No. 134 \n32:55 CB 120342: Montlake Playfield \n50:33 CB 120351: relating to City employment \n54:09 Appointment of Andrew Lee, GM and CEO of SPU \n59:02 CB 120345: vacating a portion of 29th Ave SW and SW City View St.\n1:01:34 CB 120346: relating to SPU - construction easement \n1:03:22 CB 120349: relating to City Light - Treaty between the U.S. and Canada \n1:07:10 CB 120343: relating to housing for low-income households - amended Housing Funding Policies \n1:13:22 CB 120338: relating to grant funds from non-City sources \n1:15:30 CB 120340: FAS real property lease with WSDOT \n1:17:10 Other Business", "publish_date": "2022-06-28T00:00:00"}