{"title": "Councilmember Mosqueda & partners announce legislation renewing the Seattle Housing Levy", "video_id": "fcCRG9T4j7Y", "channel_id": "UCu2IUja1ASnGIr_ORrtLReg", "description": "Councilmember Teresa Mosqueda, joined by a coalition of affordable housing developers, labor leaders, community organizations, the City of Seattle Office of Housing, and others, announced legislation (Council Bill 120584 and Resolution 32093) renewing the Seattle Housing Levy, including amendments proposed by the Seattle City Council. The Mayor and Select Committee Chair are in lockstep on the need for a robust $970 million package that invests in permanent supportive housing, resident services, workforce supports, and strong labor standards. \n\nCouncilmember Mosqueda chairs the Council’s Select Committee about the 2023 Housing Levy, which received Mayor Bruce Harrell’s seven-year, $970 million proposal for the Levy on March 30, 2023. The Select Committee has been meeting since March, unpacking the proposal, hearing from the public, and crafting amendments.  \n\nSeattle’s affordable housing needs have grown dramatically since the last Housing Levy was passed in 2016. The COVID pandemic and economic downturn have created far greater housing instability in our community than Seattle has seen in previous decades. At the same time, wages have not kept pace with inflation, and many workers in affordable housing are struggling with housing insecurity. \n\nSpeakers include:\nCouncilmember Teresa Mosqueda, City of Seattle\nPatience Malaba, Executive Director, Housing Development Consortium\nKatie Garrow, Executive Secretary-Treasurer, MLK Labor\nMaiko Winkler-Chin, Director, Office of Housing\nJames Lovell, Development Director, Chief Seattle Club\nNaomi Lewis, Registered Nurse, DESC\nK. Wyking Garrett, President & CEO, Community Land trust\n\nView the City of Seattle's commenting policy: seattle.gov/online-comment-policy\n100", "publish_date": "2023-06-01T00:00:00"}